# 1) Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series

pandas.core.series.Series

In [3]:
myindex = ["USA", "Canada", "Mexico"]
mydata = [1776, 1867, 1821]

In [4]:
myser = pd.Series(data=mydata)

In [5]:
myser

0    1776
1    1867
2    1821
dtype: int64

In [6]:
type(pd.Series)

type

In [7]:
myser = pd.Series(data=mydata, index=myindex)

In [8]:
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [9]:
myser[0]

1776

In [10]:
myser["USA"]

1776

In [11]:
ages = {"Sam":5, "Franck":10, "Spike":7}

In [12]:
# SERIES OBJECT IS ACTUALLY DICTIONARY LIKE; 
pd.Series(ages)

Sam        5
Franck    10
Spike      7
dtype: int64

In [13]:
q1 = {"Japan": 80, "China": 450, "India": 200, "USA": 250}
q2 = {"Brazil": 100, "China": 500, "India": 210, "USA": 260}

In [14]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [15]:
sales_q1, sales_q2

(Japan     80
 China    450
 India    200
 USA      250
 dtype: int64,
 Brazil    100
 China     500
 India     210
 USA       260
 dtype: int64)

In [16]:
sales_q1["Japan"]

80

In [17]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [18]:
type(sales_q2.keys())

pandas.core.indexes.base.Index

In [19]:
sales_q1*4

Japan     320
China    1800
India     800
USA      1000
dtype: int64

In [20]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [21]:
sales_q2.keys()

Index(['Brazil', 'China', 'India', 'USA'], dtype='object')

In [22]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [23]:
sales_q1.add(sales_q2, fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [24]:
first_half = sales_q1.add(sales_q2, fill_value=0)

In [25]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [26]:
sales_q1.dtype

dtype('int64')

In [27]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [28]:
first_half.dtype

dtype('float64')

In [29]:
first_half.dtypes

dtype('float64')

In [30]:
first_half = pd.Series(first_half, dtype="int64")

In [31]:
first_half.dtypes

dtype('int64')

# 2) DataFrames

In [32]:
np.random.seed(101)
mydata = np.random.randint(0, 101, (4, 3))

In [33]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [34]:
myindex = ["CA", "NY", "AZ", "TX"]
mycolumns = ["Jan", "Feb", "Mar"]

In [35]:
df = pd.DataFrame(mydata, index=myindex, columns=mycolumns)

In [36]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [38]:
pwd

'C:\\Users\\rd'

In [39]:
cd "C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas"

C:\Users\rd\Documents\UDEMY\03-Pandas

In [40]:
pwd

'C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas'

In [41]:
ls

 Volume in drive C is Windows
 Volume Serial Number is EAD0-5817

 Directory of C:\Users\rd\Documents\UDEMY\03-Pandas

26/05/2021  17:51    <DIR>          .
05/03/2024  17:49    <DIR>          ..
27/09/2020  21:52    <DIR>          .ipynb_checkpoints
12/07/2020  20:07    <DIR>          __pycache__
26/05/2021  17:51           565.390 00-Series.ipynb
08/09/2020  18:59           208.957 01-DataFrames.ipynb
08/09/2020  18:59           194.591 02-Conditional-Filtering.ipynb
13/08/2020  01:49           196.385 03-Useful-Methods.ipynb
01/07/2020  23:32            64.227 04-Missing-Data.ipynb
04/07/2020  21:28           219.627 05-Groupby-Operations-and-MultiIndex.ipynb
04/07/2020  23:19            62.966 06-Combining-DataFrames.ipynb
25/09/2020  19:04            32.972 07-Text-Methods.ipynb
08/09/2020  18:59            93.392 08-Time-Methods.ipynb
26/09/2020  00:48            65.234 09-Inputs-and-Outputs.ipynb
26/09/2020  00:46           101.081 10-Pivot-Tables.ipynb
27/09/2020  21:34            47.135 11-Pandas-Project-Exercise .ipynb
27/09/2020  21:34            52.576 12-Pandas-Project-Exercise-Solution.ipynb
05/07/2020  01:39                51 example.csv
26/09/2020  20:14             5.022 example.xlsx
12/07/2020  20:41        25.112.317 hotel_booking_data.csv
07/02/2020  20:26               177 movie_scores.csv
01/07/2020  23:56            17.727 mpg.csv
05/07/2020  01:58             5.022 my_excel_file.xlsx
05/07/2020  02:10                51 new_file.csv
26/09/2020  20:05             5.021 new_workbook.xlsx
26/09/2020  01:16                51 newfile.csv
11/07/2020  20:14            52.132 reshaping_pivot.png
03/07/2020  01:56             5.459 RetailSales_BeerWineLiquor.csv
07/07/2020  01:10             1.320 Sales_Funnel_CRM.csv
26/09/2020  18:40             1.330 sample_table.html
05/07/2020  02:10               555 simple.html
27/01/2020  22:28            18.752 tips.csv
              28 File(s)     27.129.520 bytes
               4 Dir(s)  157.248.368.640 bytes free

In [42]:
pwd

'C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas'

In [43]:
ls tips.csv

 Volume in drive C is Windows
 Volume Serial Number is EAD0-5817

 Directory of C:\Users\rd\Documents\UDEMY\03-Pandas

27/01/2020  22:28            18.752 tips.csv
               1 File(s)         18.752 bytes
               0 Dir(s)  157.248.368.640 bytes free

In [44]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\tips.csv")

In [45]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [46]:
df.keys()

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [47]:
df.keys().shape

(11,)

In [48]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [49]:
cd

C:\Users\rd

In [50]:
ls

 Volume in drive C is Windows
 Volume Serial Number is EAD0-5817

 Directory of C:\Users\rd

11/03/2024  15:14    <DIR>          .
24/02/2024  14:38    <DIR>          ..
27/02/2024  17:10    <DIR>          .anaconda
04/08/2022  14:50    <DIR>          .android
08/11/2023  23:27    <DIR>          .assistant
03/07/2023  20:51    <DIR>          .astropy
06/09/2023  13:06             3.572 .bash_history
15/02/2024  22:55    <DIR>          .conda
20/02/2024  18:44                25 .condarc
15/05/2023  20:40    <DIR>          .config
08/05/2023  16:19    <DIR>          .continuum
12/05/2023  21:01    <DIR>          .designer
08/05/2023  17:16    <DIR>          .dotnet
08/10/2021  14:08    <DIR>          .ebookreader
26/06/2023  13:51                59 .gitconfig
07/03/2024  09:27    <DIR>          .ipynb_checkpoints
28/10/2021  07:06    <DIR>          .ipython
27/02/2024  17:50    <DIR>          .jupyter
16/02/2024  09:43    <DIR>          .keras
26/06/2023  16:11                20 .lesshst
07/03/2022  23:38    <DIR>          .matplotlib
26/06/2023  13:50                14 .minttyrc
04/07/2022  11:34    <DIR>          .ms-ad
07/03/2022  23:01    <DIR>          .spyder
07/03/2024  14:31    <DIR>          .spyder-py3
26/06/2023  16:08    <DIR>          .ssh
08/05/2023  20:58    <DIR>          .templateengine
27/06/2023  09:38             8.959 .viminfo
17/11/2021  14:13               722 17_11_2021.ipynb
05/03/2024  10:15         2.399.876 27. Transfer Learning.ipynb
06/10/2021  01:41    <DIR>          3D Objects
06/03/2024  21:40            13.291 40. Word embedding.ipynb
11/03/2024  15:12             1.284 41. Word2vec.ipynb
09/10/2023  16:35           393.992 Ada.ipynb
30/10/2021  15:43    <DIR>          ansel
02/06/2010  04:21         1.347.354 Apr2005_d3dx9_25_x64.cab
02/06/2010  04:21         1.078.962 Apr2005_d3dx9_25_x86.cab
02/06/2010  04:21         1.397.830 Apr2006_d3dx9_30_x64.cab
02/06/2010  04:21         1.115.221 Apr2006_d3dx9_30_x86.cab
02/06/2010  04:21           916.430 Apr2006_MDX1_x86.cab
02/06/2010  04:21         4.162.630 Apr2006_MDX1_x86_Archive.cab
02/06/2010  04:21           179.133 Apr2006_XACT_x64.cab
02/06/2010  04:21           133.103 Apr2006_XACT_x86.cab
02/06/2010  04:21            87.101 Apr2006_xinput_x64.cab
02/06/2010  04:21            46.010 Apr2006_xinput_x86.cab
02/06/2010  04:21           698.612 APR2007_d3dx10_33_x64.cab
02/06/2010  04:21           695.865 APR2007_d3dx10_33_x86.cab
02/06/2010  04:21         1.607.358 APR2007_d3dx9_33_x64.cab
02/06/2010  04:21         1.606.039 APR2007_d3dx9_33_x86.cab
02/06/2010  04:21           195.766 APR2007_XACT_x64.cab
02/06/2010  04:21           151.225 APR2007_XACT_x86.cab
02/06/2010  04:21            96.817 APR2007_xinput_x64.cab
02/06/2010  04:21            53.302 APR2007_xinput_x86.cab
02/06/2010  04:21         1.350.542 Aug2005_d3dx9_27_x64.cab
02/06/2010  04:21         1.077.644 Aug2005_d3dx9_27_x86.cab
02/06/2010  04:21           182.903 AUG2006_XACT_x64.cab
02/06/2010  04:21           137.235 AUG2006_XACT_x86.cab
02/06/2010  04:21            87.142 AUG2006_xinput_x64.cab
02/06/2010  04:21            46.058 AUG2006_xinput_x86.cab
02/06/2010  04:21           852.286 AUG2007_d3dx10_35_x64.cab
02/06/2010  04:21           796.867 AUG2007_d3dx10_35_x86.cab
02/06/2010  04:21         1.800.160 AUG2007_d3dx9_35_x64.cab
02/06/2010  04:21         1.708.152 AUG2007_d3dx9_35_x86.cab
02/06/2010  04:21           198.096 AUG2007_XACT_x64.cab
02/06/2010  04:21           153.012 AUG2007_XACT_x86.cab
02/06/2010  04:21           867.612 Aug2008_d3dx10_39_x64.cab
02/06/2010  04:21           849.167 Aug2008_d3dx10_39_x86.cab
02/06/2010  04:21         1.794.084 Aug2008_d3dx9_39_x64.cab
02/06/2010  04:21         1.464.672 Aug2008_d3dx9_39_x86.cab
02/06/2010  04:21           121.772 Aug2008_XACT_x64.cab
02/06/2010  04:21            92.996 Aug2008_XACT_x86.cab
02/06/2010  04:21           271.412 Aug2008_XAudio_x64.cab
02/06/2010  04:21           271.038 Aug2008_XAudio_x86.cab
02/06/2010  04:21           919.044 Aug2009_D3DCompiler_42_x64.cab
02/06/2010  04:21           900.598 Aug2009_D3DCompiler_42_x86.cab
02/06/2010  04:21         3.112.111 Aug2009_d3dcsx_42_x64.cab
02/06/2010  04:21         3.319.740 Aug2009_d3dcsx_42_x86.cab
02/06/2010  04:21           232.635 Aug2009_d3dx10_42_x64.cab
02/06/2010  04:21           192.131 Aug2009_d3dx10_42_x86.cab
02/06/2010  04:21           136.301 Aug2009_d3dx11_42_x64.cab
02/06/2010  04:21           105.044 Aug2009_d3dx11_42_x86.cab
02/06/2010  04:21           930.116 Aug2009_d3dx9_42_x64.cab
02/06/2010  04:21           728.456 Aug2009_d3dx9_42_x86.cab
02/06/2010  04:22           122.408 Aug2009_XACT_x64.cab
02/06/2010  04:22            93.106 Aug2009_XACT_x86.cab
02/06/2010  04:22           273.264 Aug2009_XAudio_x64.cab
02/06/2010  04:22           272.642 Aug2009_XAudio_x86.cab
20/02/2023  19:01            34.742 boston_house_prices.csv
20/02/2023  19:01           119.913 breast_cancer.csv
09/12/2023  16:02    <DIR>          chemaxon
26/09/2023  10:51               264 Coding Decision Trees.py
24/02/2024  15:02    <DIR>          Contacts
16/02/2024  10:17            68.418 Course1. Tensorflow and Keras.ipynb
16/02/2024  20:44           104.474 Course2. Convolutional neural network Tensorflow&Keras.ipynb
05/03/2024  10:15         4.429.844 Data Augmentation.ipynb
17/02/2024  12:09    <DIR>          datasets
02/06/2010  04:22         1.357.976 Dec2005_d3dx9_28_x64.cab
02/06/2010  04:22         1.079.456 Dec2005_d3dx9_28_x86.cab
02/06/2010  04:22           212.807 DEC2006_d3dx10_00_x64.cab
02/06/2010  04:22           191.720 DEC2006_d3dx10_00_x86.cab
02/06/2010  04:22         1.571.154 DEC2006_d3dx9_32_x64.cab
02/06/2010  04:22         1.574.376 DEC2006_d3dx9_32_x86.cab
02/06/2010  04:22           192.475 DEC2006_XACT_x64.cab
02/06/2010  04:22           145.599 DEC2006_XACT_x86.cab
09/10/2023  16:35         3.362.200 Decision Tree coding.ipynb
16/02/2024  09:35             1.431 Deep learning, tensor flow and Keras.ipynb
11/03/2024  10:50    <DIR>          Desktop
20/02/2023  19:01             7.105 diabetes_data_raw.csv.gz
20/02/2023  19:01             1.050 diabetes_target.csv.gz
20/02/2023  19:01            57.523 digits.csv.gz
10/03/2024  20:37    <DIR>          Documents
10/03/2024  20:31    <DIR>          Downloads
07/12/2023  20:48               405 dsdsdsdsdsdsdsdsdsds.xyz
30/03/2011  10:40            95.576 DSETUP.dll
30/03/2011  10:40         1.566.040 dsetup32.dll
30/03/2011  10:40            44.624 dxdllreg_x86.cab
30/03/2011  10:40           517.976 DXSETUP.exe
30/03/2011  10:40            97.152 dxupdate.cab
16/02/2024  10:13    <DIR>          epic_num_reader.model
24/02/2024  15:02    <DIR>          Favorites
02/06/2010  04:22         1.247.499 Feb2005_d3dx9_24_x64.cab
02/06/2010  04:22         1.013.225 Feb2005_d3dx9_24_x86.cab
02/06/2010  04:22         1.362.796 Feb2006_d3dx9_29_x64.cab
02/06/2010  04:22         1.084.720 Feb2006_d3dx9_29_x86.cab
02/06/2010  04:22           178.359 Feb2006_XACT_x64.cab
02/06/2010  04:22           132.409 Feb2006_XACT_x86.cab
02/06/2010  04:22           194.675 FEB2007_XACT_x64.cab
02/06/2010  04:22           147.983 FEB2007_XACT_x86.cab
02/06/2010  04:22            54.678 Feb2010_X3DAudio_x64.cab
02/06/2010  04:22            20.713 Feb2010_X3DAudio_x86.cab
02/06/2010  04:22           122.446 Feb2010_XACT_x64.cab
02/06/2010  04:22            93.180 Feb2010_XACT_x86.cab
02/06/2010  04:22           276.960 Feb2010_XAudio_x64.cab
02/06/2010  04:22           277.191 Feb2010_XAudio_x86.cab
27/06/2023  09:43    <DIR>          github
06/10/2021  01:41    <DIR>          Intel
20/02/2023  19:01             2.734 iris.csv
15/11/2021  07:45    <DIR>          Jedi
02/06/2010  04:22         1.336.002 Jun2005_d3dx9_26_x64.cab
02/06/2010  04:22         1.064.925 Jun2005_d3dx9_26_x86.cab
02/06/2010  04:22           180.785 JUN2006_XACT_x64.cab
02/06/2010  04:22           133.671 JUN2006_XACT_x86.cab
02/06/2010  04:22           699.044 JUN2007_d3dx10_34_x64.cab
02/06/2010  04:22           698.472 JUN2007_d3dx10_34_x86.cab
02/06/2010  04:22         1.607.774 JUN2007_d3dx9_34_x64.cab
02/06/2010  04:22         1.607.286 JUN2007_d3dx9_34_x86.cab
02/06/2010  04:22           197.122 JUN2007_XACT_x64.cab
02/06/2010  04:22           152.909 JUN2007_XACT_x86.cab
02/06/2010  04:22           867.828 JUN2008_d3dx10_38_x64.cab
02/06/2010  04:22           849.919 JUN2008_d3dx10_38_x86.cab
02/06/2010  04:22         1.792.608 JUN2008_d3dx9_38_x64.cab
02/06/2010  04:22         1.463.878 JUN2008_d3dx9_38_x86.cab
02/06/2010  04:22            55.154 JUN2008_X3DAudio_x64.cab
02/06/2010  04:22            21.905 JUN2008_X3DAudio_x86.cab
02/06/2010  04:22           121.054 JUN2008_XACT_x64.cab
02/06/2010  04:22            93.128 JUN2008_XACT_x86.cab
02/06/2010  04:22           269.628 JUN2008_XAudio_x64.cab
02/06/2010  04:22           269.024 JUN2008_XAudio_x86.cab
02/06/2010  04:22           944.460 Jun2010_D3DCompiler_43_x64.cab
02/06/2010  04:22           931.471 Jun2010_D3DCompiler_43_x86.cab
02/06/2010  04:22           752.783 Jun2010_d3dcsx_43_x64.cab
02/06/2010  04:22           762.188 Jun2010_d3dcsx_43_x86.cab
02/06/2010  04:22           235.955 Jun2010_d3dx10_43_x64.cab
02/06/2010  04:22           197.283 Jun2010_d3dx10_43_x86.cab
02/06/2010  04:22           138.205 Jun2010_d3dx11_43_x64.cab
02/06/2010  04:22           109.445 Jun2010_d3dx11_43_x86.cab
02/06/2010  04:22           937.246 Jun2010_d3dx9_43_x64.cab
02/06/2010  04:22           768.036 Jun2010_d3dx9_43_x86.cab
02/06/2010  04:22           124.596 Jun2010_XACT_x64.cab
02/06/2010  04:22            93.686 Jun2010_XACT_x86.cab
02/06/2010  04:22           277.338 Jun2010_XAudio_x64.cab
02/06/2010  04:22           278.060 Jun2010_XAudio_x86.cab
01/07/2023  08:00            19.344 Linear Regression.ipynb
24/02/2024  15:02    <DIR>          Links
20/02/2023  19:01               212 linnerud_exercise.csv
20/02/2023  19:01               219 linnerud_physiological.csv
02/06/2010  04:22           844.884 Mar2008_d3dx10_37_x64.cab
02/06/2010  04:22           818.260 Mar2008_d3dx10_37_x86.cab
02/06/2010  04:22         1.769.862 Mar2008_d3dx9_37_x64.cab
02/06/2010  04:22         1.443.282 Mar2008_d3dx9_37_x86.cab
02/06/2010  04:22            55.058 Mar2008_X3DAudio_x64.cab
02/06/2010  04:22            21.867 Mar2008_X3DAudio_x86.cab
02/06/2010  04:22           122.336 Mar2008_XACT_x64.cab
02/06/2010  04:22            93.734 Mar2008_XACT_x86.cab
02/06/2010  04:22           251.194 Mar2008_XAudio_x64.cab
02/06/2010  04:22           226.250 Mar2008_XAudio_x86.cab
02/06/2010  04:22         1.067.160 Mar2009_d3dx10_41_x64.cab
02/06/2010  04:22         1.040.745 Mar2009_d3dx10_41_x86.cab
02/06/2010  04:22         1.973.702 Mar2009_d3dx9_41_x64.cab
02/06/2010  04:22         1.612.446 Mar2009_d3dx9_41_x86.cab
02/06/2010  04:22            54.600 Mar2009_X3DAudio_x64.cab
02/06/2010  04:22            21.298 Mar2009_X3DAudio_x86.cab
02/06/2010  04:22           121.506 Mar2009_XACT_x64.cab
02/06/2010  04:22            92.740 Mar2009_XACT_x86.cab
02/06/2010  04:22           275.044 Mar2009_XAudio_x64.cab
02/06/2010  04:22           273.018 Mar2009_XAudio_x86.cab
24/02/2024  15:02    <DIR>          Music
02/06/2010  04:22           864.600 Nov2007_d3dx10_36_x64.cab
02/06/2010  04:22           803.884 Nov2007_d3dx10_36_x86.cab
02/06/2010  04:22         1.802.058 Nov2007_d3dx9_36_x64.cab
02/06/2010  04:22         1.709.360 Nov2007_d3dx9_36_x86.cab
02/06/2010  04:22            46.144 NOV2007_X3DAudio_x64.cab
02/06/2010  04:22            18.496 NOV2007_X3DAudio_x86.cab
02/06/2010  04:22           196.762 NOV2007_XACT_x64.cab
02/06/2010  04:22           148.264 NOV2007_XACT_x86.cab
02/06/2010  04:22           994.154 Nov2008_d3dx10_40_x64.cab
02/06/2010  04:22           965.421 Nov2008_d3dx10_40_x86.cab
02/06/2010  04:22         1.906.878 Nov2008_d3dx9_40_x64.cab
02/06/2010  04:22         1.550.796 Nov2008_d3dx9_40_x86.cab
02/06/2010  04:22            54.522 Nov2008_X3DAudio_x64.cab
02/06/2010  04:22            21.851 Nov2008_X3DAudio_x86.cab
02/06/2010  04:22           121.794 Nov2008_XACT_x64.cab
02/06/2010  04:22            92.684 Nov2008_XACT_x86.cab
02/06/2010  04:22           273.960 Nov2008_XAudio_x64.cab
02/06/2010  04:22           272.611 Nov2008_XAudio_x86.cab
02/06/2010  04:22            86.037 Oct2005_xinput_x64.cab
02/06/2010  04:22            45.359 Oct2005_xinput_x86.cab
02/06/2010  04:22         1.412.902 OCT2006_d3dx9_31_x64.cab
02/06/2010  04:22         1.127.217 OCT2006_d3dx9_31_x86.cab
02/06/2010  04:22           182.361 OCT2006_XACT_x64.cab
02/06/2010  04:22           138.017 OCT2006_XACT_x86.cab
09/10/2023  16:35             7.670 ODE.ipynb
08/11/2021  08:27    <DIR>          OneDrive
11/03/2024  15:14           385.840 Pandas_review.ipynb
24/02/2024  15:02    <DIR>          Pictures
03/07/2023  10:04    <DIR>          PycharmProjects
09/10/2023  16:35            48.260 Random Forest.ipynb
24/02/2024  15:02    <DIR>          Saved Games
23/07/2023  21:54    <DIR>          scikit_learn_data
24/02/2024  15:02    <DIR>          Searches
08/05/2023  20:58    <DIR>          source
25/01/2022  16:48                 0 Sti_Trace.log
27/02/2024  17:51            11.687 Tensor Flow and Keras.ipynb
23/11/2022  18:52    <DIR>          Tracing
26/01/2023  13:08           425.343 Untitled.ipynb
08/05/2023  11:16            15.117 Untitled1.ipynb
26/09/2023  10:50                72 Untitled2.ipynb
08/08/2023  13:39             2.292 untitled-2.tex
28/09/2023  12:02                72 Untitled3.ipynb
07/10/2023  09:57               589 Untitled4.ipynb
20/02/2024  20:38                72 Untitled5.ipynb
27/02/2024  17:22             3.683 Untitled6.ipynb
27/02/2024  17:51               618 Untitled7.ipynb
27/02/2024  18:06             6.680 Untitled8.ipynb
11/03/2024  15:12               756 Untitled9.ipynb
11/03/2024  10:58    <DIR>          Videos
20/02/2023  19:01            11.157 wine_data.csv
             201 File(s)    114.882.555 bytes
              46 Dir(s)  157.248.303.104 bytes free

In [51]:
df["sex"]

0      Female
1        Male
2        Male
3        Male
4      Female
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 244, dtype: object

In [52]:
df.index[100]

100

In [53]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [54]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [55]:
df.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775

In [56]:
df.tail(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
234,15.53,3.00,Male,Yes,Sat,Dinner,2,7.76,Tracy Douglas,4097938155941930,Sat7220
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [58]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [59]:
df["tip"] + df["total_bill"]

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Length: 244, dtype: float64

In [60]:
df["tip"]

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [61]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [62]:
100*df["tip"]/df["total_bill"]

0       5.944673
1      16.054159
2      16.658734
3      13.978041
4      14.680765
         ...
239    20.392697
240     7.358352
241     8.822232
242     9.820426
243    15.974441
Length: 244, dtype: float64

In [63]:
df["tip_percentage"] = 100*df["tip"]/df["total_bill"]

In [64]:
df["tip_percentage"]

0       5.944673
1      16.054159
2      16.658734
3      13.978041
4      14.680765
         ...
239    20.392697
240     7.358352
241     8.822232
242     9.820426
243    15.974441
Name: tip_percentage, Length: 244, dtype: float64

In [65]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [66]:
df["price_per_person"] = df["total_bill"]/df["size"]

In [67]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID',
       'tip_percentage'],
      dtype='object')

In [68]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID',
       'tip_percentage'],
      dtype='object')

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  tip_percentage    244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

In [70]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.495000,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.446667,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.003333,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.840000,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.147500,Tonya Carter,4832732618637221,Sun2251,14.680765

In [71]:
df["price_per_person"] = np.round(df["total_bill"]/df["size"], 2)

In [72]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [73]:
df.drop("tip_percentage", axis=1)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [74]:
# Equivalent df.drop("tip_percentage", axis=1)
df.drop(columns="tip_percentage")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [75]:
df.shape

(244, 12)

In [76]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [77]:
df = df.set_index("Payment ID")

In [78]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
Payment ID,,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,5.944673
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,16.054159
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,16.658734
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,13.978041
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,14.680765

In [79]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'tip_percentage'],
      dtype='object')

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 244 entries, Sun2959 to Thur672
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  tip_percentage    244 non-null    float64
dtypes: float64(4), int64(2), object(5)
memory usage: 22.9+ KB

In [81]:
df = df.reset_index()

In [82]:
df.head()

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
0,Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,5.944673
1,Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,16.054159
2,Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,16.658734
3,Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,13.978041
4,Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,14.680765

In [83]:
df = df.set_index("Payment ID")

In [84]:
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
tip_percentage                5.944673
Name: Sun2959, dtype: object

In [85]:
# index 
df.iloc[10]

total_bill                  10.27
tip                          1.71
sex                          Male
smoker                         No
day                           Sun
time                       Dinner
size                            2
price_per_person             5.14
Payer Name          William Riley
CC Number            566287581219
tip_percentage          16.650438
Name: Sun2546, dtype: object

In [86]:
# label
df.loc["Sun2959"]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
tip_percentage                5.944673
Name: Sun2959, dtype: object

In [87]:
df.iloc[0:4]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
Payment ID,,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,5.944673
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,16.054159
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,16.658734
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,13.978041

In [88]:
df.loc[["Sun2959", "Sun4608"]]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
Payment ID,,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,5.944673
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,16.054159

In [89]:
df = df.drop("Sun2959", axis=0)

In [90]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
Payment ID,,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,16.054159
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,16.658734
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,13.978041
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,14.680765
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,18.623962

In [91]:
df = df.iloc[1:]

In [92]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
Payment ID,,,,,,,,,,,
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,16.658734
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,13.978041
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,14.680765
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,18.623962
Sun5985,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,22.805017

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 242 entries, Sun4458 to Thur672
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        242 non-null    float64
 1   tip               242 non-null    float64
 2   sex               242 non-null    object
 3   smoker            242 non-null    object
 4   day               242 non-null    object
 5   time              242 non-null    object
 6   size              242 non-null    int64
 7   price_per_person  242 non-null    float64
 8   Payer Name        242 non-null    object
 9   CC Number         242 non-null    int64
 10  tip_percentage    242 non-null    float64
dtypes: float64(4), int64(2), object(5)
memory usage: 22.7+ KB

In [94]:
one_raw = df.iloc[0]

In [95]:
one_raw

total_bill                     21.01
tip                              3.5
sex                             Male
smoker                            No
day                              Sun
time                          Dinner
size                               3
price_per_person                 7.0
Payer Name            Travis Walters
CC Number           6011812112971322
tip_percentage             16.658734
Name: Sun4458, dtype: object

In [96]:
# New version of pandas: No append 
dff = pd.concat([df, one_raw], ignore_index=True)

In [97]:
one_raw

total_bill                     21.01
tip                              3.5
sex                             Male
smoker                            No
day                              Sun
time                          Dinner
size                               3
price_per_person                 7.0
Payer Name            Travis Walters
CC Number           6011812112971322
tip_percentage             16.658734
Name: Sun4458, dtype: object

In [98]:
dff

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage,0
0,21.01,3.50,Male,No,Sun,Dinner,3.0,7.00,Travis Walters,6.011812e+15,16.658734,NaN
1,23.68,3.31,Male,No,Sun,Dinner,2.0,11.84,Nathaniel Harris,4.676138e+15,13.978041,NaN
2,24.59,3.61,Female,No,Sun,Dinner,4.0,6.15,Tonya Carter,4.832733e+15,14.680765,NaN
3,25.29,4.71,Male,No,Sun,Dinner,4.0,6.32,Erik Smith,2.131404e+14,18.623962,NaN
4,8.77,2.00,Male,No,Sun,Dinner,2.0,4.38,Kristopher Johnson,2.223728e+15,22.805017,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
248,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3
249,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.0
250,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Travis Walters
251,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6011812112971322
252,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.658734

In [99]:
dff = pd.concat([df, one_raw], ignore_index=True)

In [100]:
dff.iloc[0]

total_bill                       21.01
tip                                3.5
sex                               Male
smoker                              No
day                                Sun
time                            Dinner
size                               3.0
price_per_person                   7.0
Payer Name              Travis Walters
CC Number           6011812112971322.0
tip_percentage               16.658734
0                                  NaN
Name: 0, dtype: object

In [101]:
dff.iloc[-1]

total_bill                NaN
tip                       NaN
sex                       NaN
smoker                    NaN
day                       NaN
time                      NaN
size                      NaN
price_per_person          NaN
Payer Name                NaN
CC Number                 NaN
tip_percentage            NaN
0                   16.658734
Name: 252, dtype: object

In [102]:
dff.tail()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage,0
248,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3
249,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.0
250,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Travis Walters
251,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6011812112971322
252,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.658734

# 3) Conditional filtering

In [103]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,tip_percentage
Payment ID,,,,,,,,,,,
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,16.658734
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,13.978041
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,14.680765
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,18.623962
Sun5985,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,22.805017
...,...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,20.392697
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,7.358352
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,8.822232
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,9.820426
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,15.974441

In [104]:
df["tip"] > 2

Payment ID
Sun4458     True
Sun5260     True
Sun2251     True
Sun9679     True
Sun5985    False
           ...
Sat2657     True
Sat1766    False
Sat3880    False
Sat17      False
Thur672     True
Name: tip, Length: 242, dtype: bool

In [105]:
df["tip"] > 5

Payment ID
Sun4458    False
Sun5260    False
Sun2251    False
Sun9679    False
Sun5985    False
           ...
Sat2657     True
Sat1766    False
Sat3880    False
Sat17      False
Thur672    False
Name: tip, Length: 242, dtype: bool

In [106]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\tips.csv")

In [107]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [108]:
df["total_bill"] > 40

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: total_bill, Length: 244, dtype: bool

In [109]:
(df["total_bill"] > 12).head()

0     True
1    False
2     True
3     True
4     True
Name: total_bill, dtype: bool

In [110]:
bool_series = df["total_bill"] > 40

In [111]:
bool_series

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: total_bill, Length: 244, dtype: bool

In [112]:
df[df["sex"] == "Male"].head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985

In [113]:
df[bool_series]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628
102,44.30,2.50,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
197,43.11,5.00,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590

In [114]:
bool_series

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: total_bill, Length: 244, dtype: bool

In [115]:
df["total_bill"] > 30
df["sex"] == "Male"

0      False
1       True
2       True
3       True
4      False
       ...
239     True
240    False
241     True
242     True
243    False
Name: sex, Length: 244, dtype: bool

In [116]:
df[(df["total_bill"] > 30) & (df["sex"] == "Male")]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
39,31.27,5.00,Male,No,Sat,Dinner,3,10.42,Mr. Brandon Berry,6011525851069856,Sat6373
44,30.40,5.60,Male,No,Sun,Dinner,4,7.60,Todd Cooper,503846761263,Sun2274
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677
56,38.01,3.00,Male,Yes,Sat,Dinner,4,9.50,James Christensen DDS,349793629453226,Sat8903
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
83,32.68,5.00,Male,Yes,Thur,Lunch,2,16.34,Daniel Murphy,5356177501009133,Thur8801
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628
112,38.07,4.00,Male,No,Sun,Dinner,3,12.69,Jeff Lopez,3572865915176463,Sun591
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
167,31.71,4.50,Male,No,Sun,Dinner,4,7.93,Michael Lawson,3566285921227119,Sun3719
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
173,31.85,3.18,Male,Yes,Sun,Dinner,2,15.92,Scott Perez,3577115550328507,Sun9335
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851
180,34.65,3.68,Male,Yes,Sun,Dinner,4,8.66,James Hebert DDS,676168737648,Sun7544
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
187,30.46,2.00,Male,Yes,Sun,Dinner,5,6.09,David Barrett,4792882899700988,Sun9987
207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.68,Ricky Ramirez,347817964484033,Sat4505
210,30.06,2.00,Male,Yes,Sat,Dinner,3,10.02,Shawn Mendoza,30184049218122,Sat8361
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929

In [117]:
df.loc[[0,1]]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608

In [118]:
df.iloc[[0,1]]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608

In [119]:
df[(df["day"]=="Sun") | (df["day"]=="Sat")]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

In [120]:
df[(df["day"]=="Sun") & (df["day"]=="Sat")]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size, price_per_person, Payer Name, CC Number, Payment ID]
Index: []

In [121]:
df[(df["day"]=="Sun") | (df["day"]=="Sat") | (df["day"]=="Fri")]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

In [122]:
df[(df["day"]=="Fri")].head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
90,28.97,3.00,Male,Yes,Fri,Dinner,2,14.48,Daniel Mason,3597456900644078,Fri4175
91,22.49,3.50,Male,No,Fri,Dinner,2,11.24,Earl Horn,6011849326227398,Fri5700
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
93,16.32,4.30,Female,Yes,Fri,Dinner,2,8.16,Natalie Nguyen,5181236182893396,Fri6963
94,22.75,3.25,Female,No,Fri,Dinner,2,11.38,Jamie Garza,676318332068,Fri2318

In [123]:
option = ["Sat", "Sun"]

In [124]:
df["day"].isin(option)

0       True
1       True
2       True
3       True
4       True
       ...
239     True
240     True
241     True
242     True
243    False
Name: day, Length: 244, dtype: bool

In [125]:
df[df["day"].isin(option)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

# 4) Useful Methods

In [126]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\tips.csv")

In [127]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [129]:
# last four digits
def last_four(num):
    return str(num)[-4:]

In [130]:
last_four(123456789)

'6789'

In [131]:
df["last_four"] = df["CC Number"].apply(last_four)

In [132]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,2842
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,5404
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,7196
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,0950
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,8139

In [133]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221

In [134]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [135]:
df["total_bill"].head()

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

In [136]:
df["total_bill"].mean()

19.78594262295082

In [137]:
def yelp(price):
    if price < 10:
        return "$"
    elif price >= 10 and price < 30:
        return "$$"
    else:
        return "$$$"

In [138]:
df["yelp"] = df["total_bill"].apply(yelp)

In [139]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,yelp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221,$$
...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,2842,$$
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,5404,$$
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,7196,$$
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,0950,$$
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,8139,$$

In [140]:
# Apply with multiple columns
def simple(num):
    return num*2

In [141]:
simple(2)

4

In [142]:
lambda num: num*2

In [143]:
num = 2

In [144]:
df["total_bill"].apply(lambda num: num*2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [145]:
df["total_bill"].apply(lambda num: num*3)

0      50.97
1      31.02
2      63.03
3      71.04
4      73.77
       ...
239    87.09
240    81.54
241    68.01
242    53.46
243    56.34
Name: total_bill, Length: 244, dtype: float64

In [146]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,yelp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221,$$

In [147]:
def quanlity(total_bill, tip):
    if tip/total_bill > 0.25:
        return "Generous"
    else:
        return "Other"

In [148]:
quanlity(16.99, 1.01)

'Other'

In [149]:
df[["total_bill", "tip"]].apply(lambda df: quanlity(df["total_bill"], df["tip"]), axis=1)

0      Other
1      Other
2      Other
3      Other
4      Other
       ...
239    Other
240    Other
241    Other
242    Other
243    Other
Length: 244, dtype: object

In [150]:
df[["total_bill", "tip"]]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [151]:
df.keys()

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID',
       'last_four', 'yelp'],
      dtype='object')

In [152]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [153]:
df["Quantity"] = df[["total_bill", "tip"]].apply(lambda df: quanlity(df["total_bill"], df["tip"]), axis=1)

In [154]:
df["Quantity"]

0      Other
1      Other
2      Other
3      Other
4      Other
       ...
239    Other
240    Other
241    Other
242    Other
243    Other
Name: Quantity, Length: 244, dtype: object

In [155]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,yelp,Quantity
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,$$,Other
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,$$,Other
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322,$$,Other
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994,$$,Other
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221,$$,Other
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,2842,$$,Other
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,5404,$$,Other
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,7196,$$,Other
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,0950,$$,Other
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,8139,$$,Other

In [156]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,yelp,Quantity
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,$$,Other
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,$$,Other
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322,$$,Other
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994,$$,Other
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221,$$,Other

In [157]:
# Vectorize: The vectorized function evaluates pyfunc over successive tuples of the input arrays like the python map function, 
# except it uses the broadcasting rules of numpy.
df["Quantity"] = np.vectorize(quanlity)(df["total_bill"], df["tip"])

In [158]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,yelp,Quantity
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,$$,Other
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,$$,Other
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322,$$,Other
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994,$$,Other
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221,$$,Other

In [159]:
# compare to two methos using timeit; Dont forget the "r" before file location
import timeit

setup = """
import numpy as np
import pandas as pd
df = pd.read_csv(r"C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\tips.csv")

def quanlity(total_bill, tip):
    if tip/total_bill > 0.25:
        return "Generous"
    else:
        return "Other"
"""

In [160]:
stmt_one = """
df["Tip Quantity"] = df[["total_bill", "tip"]].apply(lambda df: quanlity(df["total_bill"], df["tip"]), axis=1)
"""
stmt_two = """
np.vectorize(quanlity)(df["total_bill"], df["tip"])
"""

In [161]:
timeit.timeit(setup=setup, stmt=stmt_one, number=10000)

19.865126599999712

In [162]:
# np.vectorize is much faster than the lambda
timeit.timeit(setup=setup, stmt=stmt_two, number=10000)

1.0430898000013258

In [163]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\tips.csv")

In [164]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [165]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [166]:
df.sort_values(["tip", "size"])

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954

In [167]:
df["total_bill"].max()

50.81

In [168]:
df["total_bill"].idxmax()

170

In [169]:
df.iloc[170].transpose()

total_bill                     50.81
tip                             10.0
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [170]:
type(one170_)

NameError: name 'one170_' is not defined

In [ ]:
one170_.transpose()

In [ ]:
df

In [ ]:
# New version of pandas: it must be adding numeric_only=True.
df.corr(numeric_only=True)

In [ ]:
df["sex"].value_counts()

In [ ]:
df["day"].nunique()

In [ ]:
df["day"].unique()

In [ ]:
df["day"].value_counts()

In [ ]:
# Replace and map method
df["sex"].replace(["Female", "Male"], ["F", "M"])

In [ ]:
mymap = {"Female": "F", "Male": "M"}

In [ ]:
df["sex"].map(mymap)

In [ ]:
df.duplicated()

In [ ]:
simple_df = pd.DataFrame([1, 2, 2, 2], ["a", "b", "c", "d"])

In [ ]:
simple_df

In [ ]:
simple_df.duplicated()

In [ ]:
simple_df.drop_duplicates()

In [ ]:
df["total_bill"]

In [ ]:
df[df["total_bill"].between(10, 20, inclusive="both")]

In [ ]:
df.nlargest(10, "tip")

In [ ]:
df.nsmallest(2, "tip")

In [ ]:
df.sample(5)

In [ ]:
df.sample(frac=0.1)

# 5) Missing data

In [ ]:
np.nan

In [ ]:
type(np.nan)

In [ ]:
np.NaN

In [ ]:
np.nan == np.nan

In [ ]:
np.nan is np.nan

In [ ]:
df = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas/movie_scores.csv")

In [ ]:
df

In [ ]:
df.info()

In [ ]:
df.isnull()

In [ ]:
df.notnull()

In [ ]:
df["pre_movie_score"]

In [ ]:
df[df["pre_movie_score"].notnull()]

In [ ]:
df[df["pre_movie_score"].isnull()]

In [ ]:
df[(df["pre_movie_score"].isnull()) & (df["first_name"].notnull())]

In [ ]:
#Drop the data
df.dropna()

In [ ]:
df

In [ ]:
# threshhold 
df.dropna(thresh=1)

In [ ]:
df.dropna(thresh=4)

In [ ]:
df.dropna(thresh=5)

In [ ]:
df.dropna(axis=1)

In [ ]:
df.dropna(axis=0)

In [ ]:
df.dropna(subset=["last_name"])

In [ ]:
df.dropna(subset="pre_movie_score")

In [ ]:
df.fillna("new value!!!")

In [ ]:
df["pre_movie_score"].fillna(0)

In [ ]:
df["pre_movie_score"].mean()

In [ ]:
df["pre_movie_score"].fillna(df["pre_movie_score"].mean())

In [ ]:
airline_tick = {"first": 100, "business": np.nan, "economy-plus": 50, "economy": 30}

In [ ]:
ser = pd.Series(airline_tick)

In [ ]:
ser

In [ ]:
ser.transpose()

In [ ]:
ser.interpolate()

# 6) GroupBy operation

In [ ]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\mpg.csv")

In [ ]:
 "C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas"

In [ ]:
df

In [ ]:
df.keys()

In [ ]:
df["model_year"]

In [ ]:
df.info()

In [ ]:
df.isnull().value_counts()

In [ ]:
df["model_year"].value_counts()

In [ ]:
df.head()

In [ ]:
df.groupby(["model_year"])

In [ ]:
df

In [ ]:
df = pd.DataFrame({'A': [1, 1, 2, 1, 2],
                   'B': [np.nan, 2, 3, 4, 5],
                   'C': [1, 2, 1, 1, 2]}, columns=['A', 'B', 'C'])

In [ ]:
df.groupby('A').mean()

In [ ]:
type(df)

In [ ]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\mpg.csv")

In [ ]:
type(df)

In [ ]:
df.keys()

In [ ]:
ddff = pd.DataFrame({'data1':np.random.randn(5),
                'data2':np.random.randn(5),
                'key1':['a','a','b','b','a'],
                'key2':['one','two','one','two','one']})

In [ ]:
# add "model_year" with mean() calling
df.groupby("model_year").mean("model_year")

In [ ]:
df.groupby("model_year").mean("model_year")["mpg"]

In [ ]:
df.groupby(["model_year", "cylinders"]).mean(["model_year", "cylinders"])

In [ ]:
df.groupby(["model_year", "cylinders"]).mean(["model_year", "cylinders"]).index

In [ ]:
df.groupby("model_year").describe().transpose()

In [ ]:
year_cyl = df.groupby(["model_year", "cylinders"]).mean(["model_year", "cylinders"])

In [ ]:
year_cyl.index.levels

In [ ]:
year_cyl.loc[70]

In [ ]:
df.head()

In [ ]:
year_cyl.loc[[70, 82]]

In [ ]:
year_cyl.index

In [ ]:
# Multilevel index
year_cyl

In [ ]:
year_cyl.xs(key=70, level="model_year")

In [ ]:
# cross section
year_cyl.xs(key=4, level="cylinders")

In [ ]:
four_cyl =  year_cyl.xs(key=4, level="cylinders")

In [ ]:
df[df["cylinders"].isin([6,8])]

In [ ]:
# swap
year_cyl.swaplevel()

In [ ]:
year_cyl.sort_index(level="model_year", ascending=False)

In [ ]:
year_cyl.sort_index(level="cylinders", ascending=False).head(10)

In [ ]:
df

In [ ]:
df.columns

In [ ]:
float_df = df.iloc[:, :-1]

In [ ]:
df.head()

In [ ]:
df = pd.DataFrame({'A': [0, 1, 2], 'B': [3, 4, 5]})

In [ ]:
df.agg(['sum', 'mean', 'min', 'max'], num)

In [ ]:
df.agg("mean", numeric_only=True)

In [ ]:
df = pd.read_csv("C:\\Users\\rd\\Documents\\UDEMY\\03-Pandas\\mpg.csv")

In [ ]:
df.agg("mean", numeric_only=True).transpose

In [ ]:
df.agg("mean", numeric_only=True)

In [ ]:
df.agg("mean", numeric_only=True)

In [ ]:
df.keys()

In [ ]:
df.iloc[:, :-1].agg(func="std", numeric_only=True)

In [ ]:
df.dtypes

In [ ]:
type(df)

In [ ]:
dff = pd.DataFrame({'A': [0, 1, 2], 'B': [3, 4, 5]})

In [ ]:
dff.agg("mean")

In [ ]:
dff

In [ ]:
dff.dtypes

In [ ]:
dff.isnull()

In [ ]:
dff.notna()

In [ ]:
df

In [ ]:
df.dropna(thresh=1).shape == df.shape

In [ ]:
df.dropna().shape

In [ ]:
s2 = pd.Series(['A B', '1.5', '3,000'])

In [ ]:
s2.str.isalnum()

In [ ]:
df.head()

In [ ]:
df["horsepower"] = pd.to_numeric(df["horsepower"])

In [ ]:
df["horsepower"].loc[32]

In [ ]:
df["horsepower"] = df["horsepower"].replace("?", 0)

In [ ]:
df["horsepower"] = pd.to_numeric(df["horsepower"])

In [ ]:
df["horsepower"]

In [ ]:
df.keys()

In [ ]:
df.dtypes

In [ ]:
df.agg("std", numeric_only=True)

In [ ]:
df.agg("mean", numeric_only=True)

In [ ]:
df.agg({"mpg":["max", "mean"], "weight":["mean", "std"]})

# Concat

In [171]:
data_one = {"A": ["A0", "A1", "A2", "A3"], "B": ["B0", "B1", "B2", "B3"]}

In [172]:
data_two = {"C": ["C0", "C1", "C2", "C3"], "D": ["D0", "D1", "D2", "D3"]}

In [173]:
one = pd.DataFrame(data_one)

In [174]:
two = pd.DataFrame(data_two)

In [175]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [176]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [177]:
pd.concat([one, two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [178]:
pd.concat([one, two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [179]:
pd.concat([one, two], axis=0, ignore_index = True)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
4  NaN  NaN   C0   D0
5  NaN  NaN   C1   D1
6  NaN  NaN   C2   D2
7  NaN  NaN   C3   D3

In [180]:
pd.concat([two, one], axis=0, ignore_index = True)

     C    D    A    B
0   C0   D0  NaN  NaN
1   C1   D1  NaN  NaN
2   C2   D2  NaN  NaN
3   C3   D3  NaN  NaN
4  NaN  NaN   A0   B0
5  NaN  NaN   A1   B1
6  NaN  NaN   A2   B2
7  NaN  NaN   A3   B3

In [181]:
pd.concat([two, one], axis=0)

     C    D    A    B
0   C0   D0  NaN  NaN
1   C1   D1  NaN  NaN
2   C2   D2  NaN  NaN
3   C3   D3  NaN  NaN
0  NaN  NaN   A0   B0
1  NaN  NaN   A1   B1
2  NaN  NaN   A2   B2
3  NaN  NaN   A3   B3

In [182]:
one.columns = two.columns

In [183]:
pd.concat([two, one], axis=0)

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [184]:
pd.concat([two, one], axis=0, ignore_index=True)

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3
4  A0  B0
5  A1  B1
6  A2  B2
7  A3  B3

In [185]:
# Inner Merge
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [186]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [187]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [188]:
pd.merge(registrations, logins, how="inner", on="name")

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [189]:
pd.merge(logins, registrations, how="inner", on="name")

   log_id    name  reg_id
0       2  Andrew       1
1       4    Bobo       2

In [190]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [191]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [193]:
pd.merge(left=logins, right=registrations, how="inner", on="name")

   log_id    name  reg_id
0       2  Andrew       1
1       4    Bobo       2

In [194]:
pd.merge(left=logins, right=registrations, how="outer", on="name")

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     Bobo     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

In [195]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [196]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [197]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [198]:
df1.merge(df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [199]:
pd.merge(df1, df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [200]:
pd.merge(df1, df2, how='outer', on='a')

     a    b    c
0  foo  1.0  3.0
1  bar  2.0  NaN
2  baz  NaN  4.0

In [201]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [202]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [208]:
pd.merge(left=registrations, right=logins,  how="inner")

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [209]:
pd.merge(left=registrations, right=logins,  how="outer")

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [212]:
registrations.columns

Index(['reg_id', 'name'], dtype='object')

# Text methods for string

In [214]:
email = "jose@email.com"

In [215]:
email.split("@")

['jose', 'email.com']

In [216]:
names = pd.Series(["andrew", "bobo", "claire", "david", "5"])

In [217]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [219]:
names.str.upper()

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [220]:
email.isdigit()

False

In [221]:
"5".isdigit()

True

In [222]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [223]:
tech_finance = ["GOOG, APPLE, AMZN", "JPM, BAC? GS"]

In [224]:
len(tech_finance)

2

In [225]:
tickers = pd.Series(tech_finance)

In [226]:
tickers

0    GOOG, APPLE, AMZN
1         JPM, BAC? GS
dtype: object

In [227]:
tickers.str.split(",")

0    [GOOG,  APPLE,  AMZN]
1          [JPM,  BAC? GS]
dtype: object

In [228]:
type(tickers.str.split(","))

pandas.core.series.Series

In [230]:
tickers.str.split(",")[0][0]

'GOOG'

In [233]:
tickers.str.split(",").str[0]

0    GOOG
1     JPM
dtype: object

In [234]:
tickers.str.split(",", expand=True)

      0         1      2
0  GOOG     APPLE   AMZN
1   JPM   BAC? GS   None

In [235]:
messy_names = pd.Series(["andrew  ", "bo;bo", "    claire   "])

In [236]:
messy_names

0         andrew
1            bo;bo
2        claire
dtype: object

### Time method

In [2]:
import numpy as np
import pandas as pd
from datetime import datetime

In [3]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [5]:
mydatetime = datetime(myyear, mymonth, myday, myhour, mymin, mysec)

In [6]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [7]:
mydatetime.year

2015

In [25]:
myser = pd.Series(["Nov, 3, 1990", "2000-01-01"])

In [26]:
myser

0    Nov, 3, 1990
1      2000-01-01
dtype: object

In [27]:
myser[1]

'2000-01-01'

In [22]:
aa = pd.to_datetime(['2018-10-26 12:00 -0530', '2018-10-26 12:00 -0500'], utc=True)

In [23]:
aa

DatetimeIndex(['2018-10-26 17:30:00+00:00', '2018-10-26 17:00:00+00:00'], dtype='datetime64[ns, UTC]', freq=None)

In [29]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [30]:
obvi_euro_date = "31-12-2000"

In [33]:
pd.to_datetime(obvi_euro_date)

C:\Users\rd\AppData\Local\Temp\ipykernel_11076\163700324.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [34]:
euro_date = "10-12-2000"

In [36]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [37]:
pd.to_datetime(euro_date, yearfirst=True, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [38]:
pd.to_datetime

<function pandas.core.tools.datetimes.to_datetime(arg: 'DatetimeScalarOrArrayConvertible | DictConvertible', errors: 'DateTimeErrorChoices' = 'raise', dayfirst: 'bool' = False, yearfirst: 'bool' = False, utc: 'bool' = False, format: 'str | None' = None, exact: 'bool | lib.NoDefault' = <no_default>, unit: 'str | None' = None, infer_datetime_format: 'lib.NoDefault | bool' = <no_default>, origin: 'str' = 'unix', cache: 'bool' = True) -> 'DatetimeIndex | Series | DatetimeScalar | NaTType | None'>

In [39]:
style_date = "12--Dec--2000"

In [44]:
# format="%d--%b--%Y" capital %Y
pd.to_datetime(style_date, format="%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [45]:
custom_date = "12th of Dec 2000"

In [46]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

##### Cool!!!

In [49]:
sales = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas//RetailSales_BeerWineLiquor.csv")

In [51]:
sales.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [53]:
sales["DATE"] = pd.to_datetime(sales["DATE"])

In [54]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [56]:
type(sales["DATE"])

pandas.core.series.Series

In [58]:
sales["DATE"][0].year

1992

In [59]:
sales["DATE"][0].month

1

In [60]:
sales["DATE"][0].day

1

In [82]:
sales = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas//RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [83]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [84]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [65]:
sales = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas//RetailSales_BeerWineLiquor.csv")

In [66]:
sales.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [69]:
sales = sales.set_index("DATE")

In [70]:
sales.head()

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822

In [79]:
sales.head()

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822

In [74]:
index = pd.date_range('1/1/2000', periods=9, freq='min')
series = pd.Series(range(9), index=index)
series

2000-01-01 00:00:00    0
2000-01-01 00:01:00    1
2000-01-01 00:02:00    2
2000-01-01 00:03:00    3
2000-01-01 00:04:00    4
2000-01-01 00:05:00    5
2000-01-01 00:06:00    6
2000-01-01 00:07:00    7
2000-01-01 00:08:00    8
Freq: T, dtype: int64

In [75]:
index

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 00:01:00',
               '2000-01-01 00:02:00', '2000-01-01 00:03:00',
               '2000-01-01 00:04:00', '2000-01-01 00:05:00',
               '2000-01-01 00:06:00', '2000-01-01 00:07:00',
               '2000-01-01 00:08:00'],
              dtype='datetime64[ns]', freq='T')

In [76]:
type(index)

pandas.core.indexes.datetimes.DatetimeIndex

In [80]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 340 entries, 1992-01-01 to 2020-04-01
Data columns (total 1 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1)
memory usage: 5.3+ KB

## Input&Output

#### Read&Save CSV files, HTML tables, Excel files and SQL databases

In [85]:
import pandas as pd

In [86]:
pwd

'C:\\Users\\rd'

In [93]:
df = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas/example.csv")

In [88]:
import os

In [91]:
os.getcwd()

'C:\\Users\\rd'

In [94]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [95]:
df = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas/example.csv", header=None)

In [96]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [97]:
df = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas/example.csv", index_col=0)

In [98]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [99]:
df.to_csv("C://Users//rd//Documents//UDEMY//03-Pandas/example_RD.csv")

In [100]:
df = pd.read_csv("C://Users//rd//Documents//UDEMY//03-Pandas/example_RD.csv")

In [101]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### HTML

In [103]:
pip install lxml

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (4.9.3)
Note: you may need to restart the kernel to use updated packages.

In [104]:
url = "https://en.wikipedia.org/wiki/World_population"

In [105]:
url

'https://en.wikipedia.org/wiki/World_population'

In [106]:
tables = pd.read_html(url)

In [109]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1927,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",123,33,14,13,12,12,11,15,20

In [110]:
len(tables)

30

In [112]:
tables[:10]

[      Population         1     2     3     4     5     6     7     8     9  \
 0           Year      1804  1927  1960  1974  1987  1999  2011  2022  2037
 1  Years elapsed  200,000+   123    33    14    13    12    12    11    15

      10
 0  2057
 1    20  ,
                                Region  2022 (percent)  2030 (percent)  \
 0                  Sub-Saharan Africa  1,152 (14.51%)  1,401 (16.46%)
 1    Northern Africa and Western Asia     549 (6.91%)     617 (7.25%)
 2      Central Asia and Southern Asia  2,075 (26.13%)  2,248 (26.41%)
 3  Eastern Asia and Southeastern Asia  2,342 (29.49%)  2,372 (27.87%)
 4         Europe and Northern America  1,120 (14.10%)  1,129 (13.26%)
 5     Latin America and the Caribbean     658 (8.29%)     695 (8.17%)
 6           Australia and New Zealand      31 (0.39%)      34 (0.40%)
 7                             Oceania      14 (0.18%)      15 (0.18%)
 8                               World            7942            8512

    2050 (percent)
 0  2,094 (21.62%)
 1     771 (7.96%)
 2  2,575 (26.58%)
 3  2,317 (23.92%)
 4  1,125 (11.61%)
 5     749 (7.73%)
 6      38 (0.39%)
 7      20 (0.21%)
 8            9687  ,
     0                                                  1
 0 NaN  Graphs are unavailable due to technical issues...,
                      Region Density (inhabitants/km2) Population (millions)  \
 0                      Asia                     104.1                  4641
 1                    Africa                      44.4                  1340
 2                    Europe                      73.4                   747
 3             Latin America                      24.1                   653
 4  Northern America[note 1]                      14.9                   368
 5                   Oceania                         5                    42
 6                Antarctica                        ~0             0.004[89]

                                Most populous country  \
 0                              1,418,459,382 â€“ India
 1                            0,211,401,000 â€“ Nigeria
 2  0,146,171,000 â€“ Russia, approx. 110Â million in...
 3                             0,214,103,000 â€“ Brazil
 4                      0,332,909,000 â€“ United States
 5                          0,025,917,000 â€“ Australia
 6                                        N/A[note 2]

               Most populous city (metropolitan area)
 0  13,515,000 â€“ Tokyo Metropolis (37,400,000 â€“ Gr...
 1    09,500,000 â€“ Cairo (20,076,000 â€“ Greater Cairo)
 2  13,200,000 â€“ Moscow (20,004,000 â€“ Moscow metro...
 3  12,252,000 â€“ SÃ£o Paulo City (21,650,000 â€“ SÃ£o ...
 4  08,804,000 â€“ New York City (23,582,649 â€“ New Y...
 5                                05,367,000 â€“ Sydney
 6                       00,001,258 â€“ McMurdo Station  ,
   Country / Dependency  Population  % of world         Date  \
 0                India  1425775850         NaN  14 Apr 2023
 1                China  1412600000         NaN  31 Dec 2021
 2        United States   336204157         NaN  16 Mar 2024
 3            Indonesia   278696200         NaN   1 Jul 2023
 4             Pakistan   229488994         NaN   1 Jul 2022
 5              Nigeria   216746934         NaN   1 Jul 2022
 6               Brazil   217411110         NaN  16 Mar 2024
 7           Bangladesh   168220000         NaN   1 Jul 2020
 8               Russia   147190000         NaN   1 Oct 2021
 9               Mexico   128271248         NaN  31 Mar 2022

   Source (official or from the United Nations)
 0                            UN projection[92]
 1                 National annual estimate[93]
 2                National population clock[94]
 3                 National annual estimate[95]
 4                            UN projection[96]
 5                            UN projection[96]
 6                National population clock[97]
 7               Annual Population Estimate[98]
 8          2021 preliminary census results[99]
 9                                          NaN  ,
                                                                                                          #  \
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
 0                                                 NaN
 1                                                   1
 2                                                   2
 3                                                   3
 4                                                   4
 5                                                   5
 6                                                   6
 7                                                   7
 8                                                   8
 9                                                   9
 10                                                 10
 11                                                NaN
 12  Notes: .mw-parser-output .reflist{font-size:90...

                               Most populous countries  \
                                    Unnamed: 1_level_1
                                    Unnamed: 1_level_2
                                    Unnamed: 1_level_3
                                    Unnamed: 1_level_4
                                    Unnamed: 1_level_5
                                    Unnamed: 1_level_6
                                    Unnamed: 1_level_7
                                    Unnamed: 1_level_8
                                    Unnamed: 1_level_9
                                   Unnamed: 1_level_10
                                   Unnamed: 1_level_11
 0   Graphs are unavailable due to technical issues...
 1                                            China[B]
 2                                               India
 3                                       United States
 4                                           Indonesia
 5                                            Pakistan
 6                                              Brazil
 7                                             Nigeria
 8                                          Bangladesh
 9                                              Russia
 10                                             Mexico
 11                                        World total
 12  Notes: .mw-parser-output .reflist{font-size:90...

                                                  2000  \
                                    Unnamed: 2_level_1
                                    Unnamed: 2_level_2
                                    Unnamed: 2_level_3
                                    Unnamed: 2_level_4
                                    Unnamed: 2_level_5
                                    Unnamed: 2_level_6
                                    Unnamed: 2_level_7
                                    Unnamed: 2_level_8
                                    Unnamed: 2_level_9
                                   Unnamed: 2_level_10
                                   Unnamed: 2_level_11
 0                                                 NaN
 1                                                1270
 2                                                1053
 3                                                 283
 4                                                 212
 5                                                 136
 6                                                 176
 7                                                 123
 8                                                 131
 9                                                 146
 10                                                103
 11                                               6127
 12  Notes: .mw-parser-output .reflist{font-size:90...

                                                  2015  \
                                    Unnamed: 3_level_1
                                    Unnamed: 3_level_2
                                    Unnamed: 3_level_3
                                    Unnamed: 3_level_4
                                    Unnamed: 3_level_5
                                    Unnamed: 3_level_6
                                    Unnamed: 3_level_7
                                    Unnamed: 3_level_8
                                    Unnamed: 3_level_9
                                   Unnamed: 3_level_10
                                   Unnamed: 3_level_11
 0                                                 NaN
 1                                                1376
 2                                                1311
 3                                                 322
 4                                                 258
 5                                                 208
 6                                                 206
 7                                                 182
 8                                                 161
 9                                                 146
 10                                                127
 11                                               7349
 12  Notes: .mw-parser-output .reflist{font-size:90...

                                               2030[A]  \
                                    Unnamed: 4_level_1
                                    Unnamed: 4_level_2
                                    Unnamed: 4_level_3
                                    Unnamed: 4_level_4
                                    Unnamed: 4_level_5
                                    Unnamed: 4_level_6
                                    Unnamed: 4_level_7
                                    Unnamed: 4_level_8
                                    Unnamed: 4_level_9
                                   Unnamed: 4_level_10
                                   Unnamed: 4_level_11
 0                                                 NaN
 1                                                1416
 2                                                1528
 3                                                 356
 4                                                 295
 5                                                 245
 6                                                 228
 7                                                 263
 8                                                 186
 9                                                 149
 10                                                148
 11                                               8501
 12  Notes: .mw-parser-output .reflist{font-size:90...

    Graphs are unavailable due to technical issues. There is more info on Phabricator and on MediaWiki.org.
                                                                                         Unnamed: 5_level_1
                                                                                         Unnamed: 5_level_2
                                                                                         Unnamed: 5_level_3
                                                                                         Unnamed: 5_level_4
                                                                                         Unnamed: 5_level_5
                                                                                         Unnamed: 5_level_6
                                                                                         Unnamed: 5_level_7
                                                                                         Unnamed: 5_level_8
                                                                                         Unnamed: 5_level_9
                                                                                        Unnamed: 5_level_10
                                                                                        Unnamed: 5_level_11
 0                                                 NaN
 1                                                 NaN
 2                                                 NaN
 3                                                 NaN
 4                                                 NaN
 5                                                 NaN
 6                                                 NaN
 7                                                 NaN
 8                                                 NaN
 9                                                 NaN
 10                                                NaN
 11                                                NaN
 12  Notes: .mw-parser-output .reflist{font-size:90...                                                       ,
     0                                                  1
 0 NaN  Graphs are unavailable due to technical issues...,
    Rank                 Country  Population  Area (km2)  Density (pop/km2)
 0     1               Singapore     5921231         719               8235
 1     2              Bangladesh   165650475      148460               1116
 2     3  Palestine[note 3][103]     5223000        6025                867
 3     4          Taiwan[note 4]    23580712       35980                655
 4     5             South Korea    51844834       99720                520
 5     6                 Lebanon     5296814       10400                509
 6     7                  Rwanda    13173730       26338                500
 7     8                 Burundi    12696478       27830                456
 8     9                   India  1389637446     3287263                423
 9    10             Netherlands    17400824       41543                419,
    Rank         Country  Population  Area (km2)  Density (pop/km2)  \
 0     1           India  1389637446     3287263                423
 1     2        Pakistan   242923845      796095                305
 2     3      Bangladesh   165650475      148460               1116
 3     4           Japan   124214766      377915                329
 4     5     Philippines   114597229      300000                382
 5     6         Vietnam   103808319      331210                313
 6     7  United Kingdom    67791400      243610                278
 7     8     South Korea    51844834       99720                520
 8     9          Taiwan    23580712       35980                655
 9    10       Sri Lanka    23187516       65610                353

   Population trend[citation needed]
 0                           Growing
 1                   Rapidly growing
 2                           Growing
 3                    Declining[104]
 4                           Growing
 5                           Growing
 6                           Growing
 7                            Steady
 8                            Steady
 9                           Growing  ,
     0                                                  1
 0 NaN  Graphs are unavailable due to technical issues...]

In [113]:
tables[1]

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [114]:
type(tables[1])

pandas.core.frame.DataFrame

In [115]:
tables[1].columns

Index(['Region', '2022 (percent)', '2030 (percent)', '2050 (percent)'], dtype='object')

In [116]:
tables[0].columns

Index(['Population', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10'], dtype='object')

In [120]:
world_topten = tables[4]

In [121]:
world_topten.columns

Index(['Country / Dependency', 'Population', '% of world', 'Date',
       'Source (official or from the United Nations)'],
      dtype='object')

In [122]:
world_topten

,Country / Dependency,Population,% of world,Date,Source (official or from the United Nations)
0,India,1425775850,NaN,14 Apr 2023,UN projection[92]
1,China,1412600000,NaN,31 Dec 2021,National annual estimate[93]
2,United States,336204157,NaN,16 Mar 2024,National population clock[94]
3,Indonesia,278696200,NaN,1 Jul 2023,National annual estimate[95]
4,Pakistan,229488994,NaN,1 Jul 2022,UN projection[96]
5,Nigeria,216746934,NaN,1 Jul 2022,UN projection[96]
6,Brazil,217411110,NaN,16 Mar 2024,National population clock[97]
7,Bangladesh,168220000,NaN,1 Jul 2020,Annual Population Estimate[98]
8,Russia,147190000,NaN,1 Oct 2021,2021 preliminary census results[99]
9,Mexico,128271248,NaN,31 Mar 2022,NaN

In [126]:
world_topten.dropna(axis=1, thresh=2)

,Country / Dependency,Population,Date,Source (official or from the United Nations)
0,India,1425775850,14 Apr 2023,UN projection[92]
1,China,1412600000,31 Dec 2021,National annual estimate[93]
2,United States,336204157,16 Mar 2024,National population clock[94]
3,Indonesia,278696200,1 Jul 2023,National annual estimate[95]
4,Pakistan,229488994,1 Jul 2022,UN projection[96]
5,Nigeria,216746934,1 Jul 2022,UN projection[96]
6,Brazil,217411110,16 Mar 2024,National population clock[97]
7,Bangladesh,168220000,1 Jul 2020,Annual Population Estimate[98]
8,Russia,147190000,1 Oct 2021,2021 preliminary census results[99]
9,Mexico,128271248,31 Mar 2022,NaN

In [131]:
world_topten.dropna(axis=1, thresh=4)

,Country / Dependency,Population,Date,Source (official or from the United Nations)
0,India,1425775850,14 Apr 2023,UN projection[92]
1,China,1412600000,31 Dec 2021,National annual estimate[93]
2,United States,336204157,16 Mar 2024,National population clock[94]
3,Indonesia,278696200,1 Jul 2023,National annual estimate[95]
4,Pakistan,229488994,1 Jul 2022,UN projection[96]
5,Nigeria,216746934,1 Jul 2022,UN projection[96]
6,Brazil,217411110,16 Mar 2024,National population clock[97]
7,Bangladesh,168220000,1 Jul 2020,Annual Population Estimate[98]
8,Russia,147190000,1 Oct 2021,2021 preliminary census results[99]
9,Mexico,128271248,31 Mar 2022,NaN

In [132]:
world_topten.dropna(axis=1)

  Country / Dependency  Population         Date
0                India  1425775850  14 Apr 2023
1                China  1412600000  31 Dec 2021
2        United States   336204157  16 Mar 2024
3            Indonesia   278696200   1 Jul 2023
4             Pakistan   229488994   1 Jul 2022
5              Nigeria   216746934   1 Jul 2022
6               Brazil   217411110  16 Mar 2024
7           Bangladesh   168220000   1 Jul 2020
8               Russia   147190000   1 Oct 2021
9               Mexico   128271248  31 Mar 2022

In [133]:
world_top =  world_topten.dropna(axis=1)

In [136]:
world_top.to_html("C://Users//rd//Documents//UDEMY//03-Pandas//sample_table.html", index=False)

#### Excel file

In [144]:
df = pd.read_excel("C://Users//rd//Documents//UDEMY//03-Pandas/my_excel_file.xlsx")

In [142]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [145]:
wb = pd.ExcelFile("C://Users//rd//Documents//UDEMY//03-Pandas/my_excel_file.xlsx")

In [146]:
wb.sheet_names

['First_Sheet']

In [147]:
df = pd.read_excel("C://Users//rd//Documents//UDEMY//03-Pandas/my_excel_file.xlsx", sheet_name="First_Sheet")

In [148]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [150]:
excel_sheet_dict = pd.read_excel("C://Users//rd//Documents//UDEMY//03-Pandas/my_excel_file.xlsx", sheet_name=None)

In [151]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [152]:
excel_sheet_dict["First_Sheet"]

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [153]:
our_df = excel_sheet_dict["First_Sheet"]

In [157]:
our_df.to_excel("C://Users//rd//Documents//UDEMY//03-Pandas//example.xlsx", sheet_name="hello", index=True)

In [158]:
our_df.to_excel("C://Users//rd//Documents//UDEMY//03-Pandas//example1.xlsx", sheet_name="hello1", index=False)

#### SQL

In [161]:
from sqlalchemy import create_engine

In [162]:
temp_db = create_engine("sqlite:///:memory:")

In [163]:
temp_db

Engine(sqlite:///:memory:)

In [165]:
df = pd.DataFrame(data=np.random.randint(0, 100, size=(4, 4)), columns=["a", "b", "c", "d"])

In [166]:
df

    a   b   c   d
0  85  17  46  40
1  68  31  25  31
2  27  81   3  50
3  91  36   3   0

In [167]:
df.to_sql(name="new_table", con=temp_db)

4

In [169]:
pd.read_sql(sql="new_table", con=temp_db)

   index   a   b   c   d
0      0  85  17  46  40
1      1  68  31  25  31
2      2  27  81   3  50
3      3  91  36   3   0

In [173]:
result = pd.read_sql_query(sql="SELECT a,c FROM new_table", con=temp_db)

In [174]:
result

    a   c
0  85  46
1  68  25
2  27   3
3  91   3

### Pivot tables